app/controllers/books_controller.rb

SELECT "authors".* FROM "authors"
---
  def new
    @book = Book.new
    @authors = Author.all

SELECT "authors".* FROM "authors"
---
  def edit
    @authors = Author.all