app/controllers/comments_controller.rb

SELECT  "books".* FROM "books" WHERE "books"."id" = $1 LIMIT $2  [["id", 6], ["LIMIT", 1]]
INSERT INTO "comments" ("content", "user_id", "commentable_type", "commentable_id", "created_at", "updated_at") VALUES ($1, $2, $3, $4, $5, $6) RETURNING "id"  [["content", "hello"], ["user_id", 1], ["commentable_type", "Book"], ["commentable_id", 6], ["created_at", "2020-05-12 02:31:15.429117"], ["updated_at", "2020-05-12 02:31:15.429117"]]
---
  def create
    @comment = Comment.new(comment_params)
    @comment.user_id |= current_user.id
    @book = Book.find(params[:book_id])

    flash[:comment] = @comment.errors.messages unless @comment.save

SELECT  "books".* FROM "books" WHERE "books"."id" = $1 LIMIT $2  [["id", 6], ["LIMIT", 1]]
---
  def update
    flash[:comment] = @comment.errors.messages unless @comment.update(comment_params)

    redirect_back fallback_location: Book.find(params[:book_id])