app/controllers/sessions_controller.rb

  def create
    @user = User.find_by_email(params[:session][:email].downcase)
---
SELECT  "users".* FROM "users" WHERE "users"."email" = $1 LIMIT $2  [["email", "casperjaclyn@gmail.com"], ["LIMIT", 1]]