app/controllers/users_controller.rb

SELECT "users".* FROM "users" WHERE (LOWER(name) LIKE '%j%') ORDER BY "users"."name" ASC
---
  def search
    @users = User.like_lower_email(params[:q]).order(:name)

INSERT INTO "users" ("name", "email", "password_digest", "avatar", "created_at", "updated_at") VALUES ($1, $2, $3, $4, $5, $6) RETURNING "id"
---
  def create
    @user = User.new(user_params)

    if @user.save